Перем КонтекстЯдра;
Перем Утверждения;

//{ основная процедура для юнит-тестирования xUnitFor1C
Процедура Инициализация(КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	Утверждения = КонтекстЯдра.Плагин("БазовыеУтверждения");
КонецПроцедуры

Процедура ЗаполнитьНаборТестов(НаборТестов, КонтекстЯдраПараметр) Экспорт
	КонтекстЯдра = КонтекстЯдраПараметр;
	НаборТестов.Добавить("ТестНастроек_ВалютныеОперацииВключены");
	НаборТестов.Добавить("ТестНастроек_ВалютаРеглРавнаВалютеУпр");
	НаборТестов.Добавить("ТестНастроек_ВалютаРеглРавнаВалютеУпр3");

КонецПроцедуры

//}

//{ Блок юнит-тестов

Процедура ТестНастроек_ВалютныеОперацииВключены() Экспорт
	Утверждения.ПроверитьИстину(ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций"));
КонецПроцедуры

Процедура ТестНастроек_ВалютаРеглРавнаВалютеУпр() Экспорт
	Утверждения.ПроверитьРавенство(Константы.ВалютаУчета.Получить(), Константы.НациональнаяВалюта.Получить());
КонецПроцедуры

Процедура ТестНастроек_ВалютаРеглРавнаВалютеУпр3() Экспорт
	Утверждения.ПроверитьРавенство(Константы.ВалютаУчета.Получить(), Константы.НациональнаяВалюта.Получить());
КонецПроцедуры
